#include <stdio.h>
#include <stdlib.h>

int CheckDate(int* p){

	int tmp[7] = { 0 };

	int i;
	for (i = 0; i < 5; i++){
		// 遍历，看是否有重复，有重复返回0，如果发现没有重复的，就返回1
		if (tmp[p[i]]){
			return 0;
		}
		tmp[p[i]] = 1;
	}
	return 1;
}

//int checkDate(int* p){
//	char tmp = 0;
//	int i;
//	for (i = 0; i < 5; i++){
//		// 遍历，看是否有重复，有重复返回0，如果发现没有重复的，就返回1
//		// 五个可能性，假设有8位 0000 0000 ，
//		// 如果1,2,3,4,5,都出现了，=> 00111110 = 3E
//		tmp |= 1 << p[i];
//		}
//	return tmp == 0x3E;
//}


int main(){	
	// 遍历所有的可能性
	int p[5];
	// 得到五层循环，0, 1, 2, 3，4对应五个选手
	// 名次为1, 2, 3，4, 5  选手分别为0,1,2,3,4
	for (p[0] = 1; p[0] <= 5; p[0]++){
		for (p[1] = 1; p[1] <= 5; p[1]++){
			for (p[2] = 1; p[2] <= 5; p[2]++){
				for (p[3] = 1; p[3] <= 5; p[3]++){
					for (p[4] = 1; p[4] <= 5; p[4]++){
						// 每个选手都只说对了一半
						// A选手说： B第二，我第三；
						if ((p[1] == 2) + (p[0] == 3) == 1 &&
							// B选手说：我第二，E第四；
							(p[1] == 2) + (p[4] == 4) == 1 &&
							// C选手说：我第一，D第二；
							(p[2] == 1) + (p[3] == 2) == 1 &&
							// D选手说：C最后， 我第三；
							(p[2] == 5) + (p[3] == 3) == 1 &&
							// E选手说：我第四，A第一;
							(p[4] == 4) + (p[0] == 1) == 1 &&
							// 名次必须为1—5， 不能有重复并列的
							CheckDate(p)){
								for (int i = 0; i < 5; i++){
									printf("%d ", p[i]);
								}
								putchar('\n');
							}
					}
				}
			}
		}
	}
	// 名次为  A:第3名  B:第1名  C:第5名  D:第2名  E:第4名
	system("pause");
	return 0;
}

